IDEA Open Model
AnchorGrid Class
Compatible with IDEA StatiCa 20.1
 Data of the anchor grid
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.BoltGrid
 IdeaRS.OpenModel.Connection.AnchorGrid
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class AnchorGrid : BoltGrid
Public Class AnchorGrid
	Inherits BoltGrid
The AnchorGrid type exposes the following members.
Constructors
Name | Description
AnchorGrid
Initializes a new instance of the AnchorGrid class
Top
Properties
Name | Description
AnchorLen
 Anchor lenght
 (Inherited from BoltGrid.)
AxisX
 Bolt grid LCS - Axis X
 (Inherited from BoltGrid.)
AxisY
 Bolt grid LCS - Axis Y
 (Inherited from BoltGrid.)
AxisZ
 Bolt grid LCS - Axis Z
 (Inherited from BoltGrid.)
BoltAssemblyName
 The description of the bolt assembly
 (Inherited from BoltGrid.)
BoreHole
 The BoreHole of bold
 (Inherited from BoltGrid.)
ConcreteBlock
 Data of concrete block
ConnectedPartIds
 Id of the weld
 (Inherited from BoltGrid.)
ConnectedPlates
 Identifiers of the connected plates
 (Inherited from BoltGrid.)
DiagonalHeadDiameter
 The Diagonal Head Diameter of bold
 (Inherited from BoltGrid.)
Diameter
 The diameter of bold
 (Inherited from BoltGrid.)
HeadDiameter
 The head diameter of bold
 (Inherited from BoltGrid.)
HeadHeight
 The Head Height of bold
 (Inherited from BoltGrid.)
HoleDiameter
 The diameter of the hole
 (Inherited from BoltGrid.)
Id
 Unique Id of the bolt grid
 (Inherited from BoltGrid.)
IsAnchor
 Is Anchor
 (Inherited from BoltGrid.)
Material
 The material of the bolt assembly
 (Inherited from BoltGrid.)
NutThickness
 The Nut Thickness of bold
 (Inherited from BoltGrid.)
Origin
 Origin of the bolt grid LCS
 (Inherited from BoltGrid.)
Positions
 Positions of holes in the local coodinate system of the bolt grid
 (Inherited from BoltGrid.)
Standard
 The standard of the bolt assembly
 (Inherited from BoltGrid.)
TensileStressArea
 The Tensile Stress Area of bold
 (Inherited from BoltGrid.)
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace